# Enade - Transofrmação de Dados - Parte 01

In [1]:
# Importação das Bibliotecas

import pandas as pd
import numpy as np
import os

In [2]:
# Importação dos dados extraido na aula anterior
# Leitura do arquivo csv
enade = pd.read_csv("./enade2019/2019/3.DADOS/microdados_enade_2019.txt",sep = ";", decimal=",")

In [3]:
enade.head()

,NU_ANO,CO_IES,CO_CATEGAD,CO_ORGACAD,CO_GRUPO,CO_CURSO,CO_MODALIDADE,CO_MUNIC_CURSO,CO_UF_CURSO,CO_REGIAO_CURSO,...,QE_I59,QE_I60,QE_I61,QE_I62,QE_I63,QE_I64,QE_I65,QE_I66,QE_I67,QE_I68
0,2019,1,10002,10028,5710,3,1,5103403,51,5,...,2.0,5.0,1.0,1.0,2.0,5.0,8.0,7.0,1.0,2.0
1,2019,1,10002,10028,5710,3,1,5103403,51,5,...,1.0,4.0,2.0,2.0,2.0,5.0,4.0,4.0,2.0,2.0
2,2019,1,10002,10028,5710,3,1,5103403,51,5,...,3.0,4.0,4.0,3.0,3.0,4.0,1.0,1.0,1.0,4.0
3,2019,1,10002,10028,5710,3,1,5103403,51,5,...,3.0,5.0,2.0,2.0,2.0,3.0,3.0,4.0,3.0,3.0
4,2019,1,10002,10028,5710,3,1,5103403,51,5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

- CO_IES
- CO_CATEGAD
- CO_GRUPO
- CO_MODALIDADE
- CO_UF_CURSO
- CO_REGIAO_CURSO
- NU_IDADE
- TP_SEXO
- NT_GER
- NT_FG
- NT_ CE

Outros dados
- 01: Estado Civil
- 02: Cor ou raça
- 04: Escolaridade do Pai
- 05: Escolaridade da Mãe
- 08: Renda Familiar
- 10: Situação de Trabalho
- 11: Situação da Bolsa
- 14: Intercâmbio
- 15: Cotas
- 23: Horas de Estudo / Semana
- 25: Motivo de escolha do curso
- 26: Motivo de escolha da IES (Instituição de Ensino Superior)

In [5]:
# NT_GER Nota Geral
enade.NT_GER.describe()

count    390091.000000
mean         44.076610
std          14.542059
min           0.000000
25%          33.200000
50%          43.800000
75%          54.800000
max          93.000000
Name: NT_GER, dtype: float64

In [8]:
#Contagem de nota geral nula
enade.NT_GER.isnull().sum()

43839

In [10]:
# Retorna uma Tupla com as dimensões de linhas e colunas do data frame
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.shape.html
enade.shape

(433930, 137)

In [ ]:
# Quantidade relativa de nulos
enade.NT_GER.isnull().sum() / enade.shape[0]